Archiwum/openFoam_MIN/_study_runs/re100Cylinder/v3_u15_d35_h20/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  laminar;
